package ssvr;


import static org.junit.Assert.assertEquals;
import static org.junit.Assert.assertFalse;
import static org.junit.Assert.fail;

import org.junit.After;
import org.junit.AfterClass;
import org.junit.Before;
import org.junit.BeforeClass;
import org.junit.Test;

import util.DateTimeUtil;

import com.cabis.fw.util.gram.GramExecutor;
import com.cabis.xutil.StringUtil;

// SendDaemon 은 로컬에서 테스트 할 수 없다
//  SendDaemon이 KIBNET의 서버에 직접 연결되어야 테스트가능하다
//  SendDaemon 테스트는 개발서버의 SendDaemon 에 접속하여 테스트 하도록 작성했다.
// config.properties의 정보가 테스트 데이터베이스를 선택하도록 주의할 것.
//  이 환경파일이 리얼 데이터베이스를 선택하면 리얼의 SendDaemon을 호출 한다
// 아래 클래스의 설명을 주의 깊게 읽어보고 수정할 것
public class SendDaemonTest {

	private static String today = null;
	private static int startTime = 0;
	private static int trNo = 0;

	// config.properties 에 의해 DB가 선택됨
	//   config.properties는 클래스 root 에 있어야 함
	// KIBNET 대외계관련 선언
	// 1. GRAM_CD 로 채널 정보 가져오기
	//    TABLE - GUSER.GSCT_GRAM_BASE
	//      DEV  - CHNL04
	//      REAL - CHNL14
	// 2. 1번에서 선택된 채널[CHNL04]에서 IP / PORT 가져오기
	//    TABLE - GUSER.GSCT_GRAM_CHNL
	//      DEV  - IP:172.20.101.20 PORT:9130
	//      REAL - IP:172.20.101.20 PORT:9530
	private final String GRAM_CD = "KB0200";

//	static String RealTestIP = "172.20.101.20"; // HIC Real서버; 
//	String kibRealIP = "192.168.4.100";  // KIBNET REAL
//	private final static String sdRealIP = "172.20.101.20";  // KIBNET TEST - 개발자 컴에서 테스트 안됨
//	private final static String sdTestIP = sdRealIP;  // HIC 테스트서버; 
//	private final static String localTestIP = "127.0.0.1";    // 로컬 
	
	
//	static int port = 50811;             // KIBNET PORT
//	static int sdRealPort    = 9530;     // sendDaemon PORT REAL
//	private final static int sdDevPort     = 9130;     // sendDaemon PORT DEV
//	private final static int sdDevLocalPort= sdDevPort;// sendDaemon PORT LOCAL

	// 개발자 로칼
//	static String ip = localTestIP;
//	static int  port = sdDevLocalPort;
	
	// 대외계 개발 서버
//	private static String ip = sdTestIP;
//	private static int  port = sdDevPort;
//	
//	private static Socket     socket = null;
//	private static BufferedReader in = null;
//	private static BufferedWriter out= null;
	// 응답 전문 - 타행환미개시 - 은행미개시 경우 
	//                                                     20032901 - search
	//                                                     20032902 - out                                                        920 woori                                                                                                                                                                                                                                                                   20                                            20
	//                                                     20032903 - image account                                              988 shinhan                                                                                                                                                                                                                                                                 88                                            88
    //    -------------------------------------####====----========-===-========---------=----====rrryyyymmddhhmm4s#####8#=-bankcode*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------                           -------------=-------------=============bankcode==n234567890123456name567890123456namebankcode00----------------========--------------------=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
    //    ---------------------------------    ####====----========-===-========---------=----====rrryyyymmddhhmm4s#####8#=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890-------------=-------------=============bankcode==n234567890123456name567890123456name--------00n23456789012345n========name567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
    //    ---------------------------------    ####====----========-===-========---------=----====rrryyyymmddhhmm4s#####8#=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890-------------=-------------=============bankcode==                name567890123456namebankbank00n23456789012345n========name567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
    //    ---------------------------------    ####====----========-===-========---------=----====rrryyyymmddhhmm4s#####8#=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890-------------=-------------=============bankcode==n234567890123456                    bankcode00n23456789012345n========--------------------=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
    //    ---------------------------------    ####====----========-===-========---------=----====rrryyyymmddhhmm4s#####8#=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890-------------=-------------=============bankcode==n234567890123456                                                                          =====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================

	private final int SOCKET_LEN = 4;
	private final int AP_COMMON_LEN = 300;
	private final int 지급이체_전문_입금계좌부_길이 = 86;
	
//	private final String SD_RECV = "6";
//	private final String SD_SEND = "5";
//	private final String SD_RESULT = "000";
//	private final String SD_YYYYMMDDHHMMSSNNNNNNN = "yyyymmddhhmmss#######";
//	private final String BANK_WR = "20"; // 우리
//	private final String BANK_SH = "88"; // 신한
//	private final String ACNT_NO_16 = "                ";

	@BeforeClass
	public static void setUpBeforeClass() throws Exception {
		today = DateTimeUtil.getToday08();
		startTime = DateTimeUtil.getTime();
		trNo = startTime; 
	}

	@AfterClass
	public static void tearDownAfterClass() throws Exception {
	}

	@Before
	public void setUp() throws Exception {
	}

	@After
	public void tearDown() throws Exception {
//		try {
//			Thread.sleep(1000);
//		} catch (InterruptedException e) {
//			e.printStackTrace();
//		}
	}

	private int 한글개수(String 소스) {
		int 한글수 = 0;
		
		for(int i = 0; i < 소스.length(); i++) {
			char 한글자 = 소스.charAt(i);
			if(한글자 > 255 ) 한글수++ ;
		}
		return 한글수;
	}
	
	@Test
	public void test한글개수() {
		assertEquals(3, 한글개수("abc가나다abc"));
		assertEquals(3, 한글개수("가나다abcabc"));
		assertEquals(3, 한글개수("abcabc가나다"));
		assertEquals(9, "abcabc가나다".length());
		assertEquals(0, 한글개수("abcabc"));
	}
	
//	03	기업은행
//	04	국민은행
//	05	외환은행
//	07	수협
//	11	농협
//	20	우리은행
//	23	제일은행
//	27	씨티은행
//	31	대구은행
//	32	부산은행
//	34	광주은행
//	35	제주은행
//	37	전북은행
//	39	경남은행
//	45	새마을금고
//	48	신협
//	71	정통부
//	81	하나은행
//	88	신한은행
	private String 은행별수수료(String 은행코드) {
		//                        우리  신한 
		String[] 은행코드모음 = { "20", "88", "" };
		String[] 은행별수수료 = { "00100", "00500", "" };

		return (은행코드.equals(은행코드모음[0]) ? 은행별수수료[0] : 은행별수수료[1]);
	}
	
	private String 성공전송전문으로전환(String 전송전문, String 전문번호, String 은행코드) {
		String[] 우리은행_예상전문        = {    "06040600000920032902000062003290220032902 302101100000"
												,"2000000920620032901                                                                                                                                     0 000643300      정상처리                                0000000000          "
												,"00000020001002638811651           하이캐피탈          "
												,"0000000000000000000000000000000000000000000000000000000000000000000000000000000000000               00000                                                  " };

		String 전문몸통앞부분 = 전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이);
		int 한글수 = 한글개수(전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이));
		String 전문몸통앞부분_한글처리 = 전문몸통앞부분.substring(0, 전문몸통앞부분.length()-한글수);
		
		return 우리은행_예상전문[0] + 전문번호 + 우리은행_예상전문[1] + 전문몸통앞부분_한글처리 + 우리은행_예상전문[2] + 은행별수수료(은행코드) + 우리은행_예상전문[3];
	}
	
	private String 오류_같은계좌이체전송전문으로전환(String 전송전문, String 전문번호) {           //rrr - 467 같은계좌이체오류코드 
		//   ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_예상전문        = {    "06040600000920032902000062003290220032902 302101100467"
		//-------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
												,"2000000920620032901                                                                                                                                     0 002146308      입금,지급계좌가 동일한 거래는 안됩니다  0000000000          "
												//bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
												,"00000020001002638811651           하이캐피탈               0000000000000000000000000000000000000000000000000000000000000000000000000000000000000               00000                                                  " };

		String 전문몸통앞부분 = 전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이);
		int 한글수 = 한글개수(전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이));
		String 전문몸통앞부분_한글처리 = 전문몸통앞부분.substring(0, 전문몸통앞부분.length()-한글수);
		
		return 우리은행_예상전문[0] + 전문번호 + 우리은행_예상전문[1] + 전문몸통앞부분_한글처리 + 우리은행_예상전문[2];
	}
	
	private String 오류_없는계좌이체전송전문으로전환(String 전송전문, String 전문번호) {           //rrr - 755 해지계좌 오류코드 - 계좌없는경우발생하는 코드 
		//   ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_예상전문        = {    "06040600000920032902000062003290220032902 302101100755"
		//-------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
												,"2000000920620032901                                                                                                                                     0 002035846      해지계좌임                              0000002044          "
												//bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
												,"00000020001002638811651           하이캐피탈               0000000000000000000000000000000000000000000000000000000000000000000000000000000000000               00000                                                  " };

		String 전문몸통앞부분 = 전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이);
		int 한글수 = 한글개수(전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이));
		String 전문몸통앞부분_한글처리 = 전문몸통앞부분.substring(0, 전문몸통앞부분.length()-한글수);
		
		return 우리은행_예상전문[0] + 전문번호 + 우리은행_예상전문[1] + 전문몸통앞부분_한글처리 + 우리은행_예상전문[2];
	}
	
	private String 오류_산업_없는계좌이체전송전문으로전환(String 전송전문, String 전문번호) {           //rrr - 249 계좌없음 or 가상계좌로 거래불가 - 계좌없는경우발생하는 코드 
		//   ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_예상전문        = {    "06040600000920032902000062003290220032902 302101100249"
		//-------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
												,"2000000920620032901                                                                                                                                     0 002904304      계좌없음 or 가상계좌로 거래불가         0000002006          "
												//bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
												,"00000020001002638811651           하이캐피탈               0000000000000000000000000000000000000000000000000000000000000000000000000000000000000               00000                                                  " };

		String 전문몸통앞부분 = 전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이);
		int 한글수 = 한글개수(전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이));
		String 전문몸통앞부분_한글처리 = 전문몸통앞부분.substring(0, 전문몸통앞부분.length()-한글수);
		
		return 우리은행_예상전문[0] + 전문번호 + 우리은행_예상전문[1] + 전문몸통앞부분_한글처리 + 우리은행_예상전문[2];
	}
	
	private String 오류_지급계좌없는계좌이체전송전문으로전환(String 전송전문, String 전문번호) {           //rrr - 404 기본원장발견안됨 오류코드 - 계좌없는경우발생하는 코드 
		//   ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_예상전문        = {    "06040600000920032902000062003290220032902 302101100404"
		//-------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
												,"2000000920620032901                                                                                                                                     0 003727444      기본원장발견안됨.당행으로확인요망       0000002015          "
												//bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
												,"00000020001002638811652           하이캐피탈               0000000000000000000000000000000000000000000000000000000000000000000000000000000000000               00000                                                  " };

		String 전문몸통앞부분 = 전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이);
		int 한글수 = 한글개수(전송전문.substring(SOCKET_LEN+AP_COMMON_LEN, SOCKET_LEN+AP_COMMON_LEN+지급이체_전문_입금계좌부_길이));
		String 전문몸통앞부분_한글처리 = 전문몸통앞부분.substring(0, 전문몸통앞부분.length()-한글수);
		
		return 우리은행_예상전문[0] + 전문번호 + 우리은행_예상전문[1] + 전문몸통앞부분_한글처리 + 우리은행_예상전문[2];
	}
	
	private void 예상수신전문과실제전문비교(String 예상수신전문, String 실제전문) {
		// 전문에서
		// 날짜 부분 무시 - 50 column 8자리
		// 타임 부분 무시 - 58 column 6자리
		// 계좌잔액무시 - 319 column 13자리
		// 수수료금액 무시 (테스트와 리얼 차이) - 445 column 5자리
		@SuppressWarnings("unused")
		int 예상전문한글수 = 0;
		@SuppressWarnings("unused")
		int 실제전문한글수 = 0;
		
		assertEquals(예상수신전문.substring( 0,  50+SOCKET_LEN)
					,    실제전문.substring( 0,  50+SOCKET_LEN));
		
		assertEquals(예상수신전문.substring(SOCKET_LEN + 64, SOCKET_LEN + 81)
					,    실제전문.substring(SOCKET_LEN + 64, SOCKET_LEN + 81));
		// 오차가 있을수 있다.
		// 왜냐면, 자바에서 한글을 1자로 인식하기 때문에
		// 전문을 보고 바이트수로 자른것은 한글을 1자 인식으로 인해
		// 더많은 전문이 선택되고,
		// 이 선택된 전문에 뒤부분에 한글이 있을경우, 한글이 많이 있는것으로 인지하기 때문이다.
		// 바이트배열로 바꾸고 테스트를 해볼 필요가 있다.
		// 바이트배열로 바꿔 처리했을 경우 정확하게 나오는지 확인 해 봐도 될것이다.
		// 여기서 영향은 미비하기에
		// 일단 간단하게 구현해서 처리하도록 했다
		// 테스트에서만 사용하는 이유도 있다.
//		예상전문한글수 = 한글개수(예상수신전문.substring(SOCKET_LEN + 81, SOCKET_LEN + 314));
//		실제전문한글수 = 한글개수(    실제전문.substring(SOCKET_LEN + 81, SOCKET_LEN + 314));
//		assertEquals(예상수신전문.substring(SOCKET_LEN + 81, SOCKET_LEN + 314 - 예상전문한글수)
//					,    실제전문.substring(SOCKET_LEN + 81, SOCKET_LEN + 314 - 실제전문한글수));
		
		예상전문한글수 = 한글개수(예상수신전문.substring(SOCKET_LEN + 327));
		실제전문한글수 = 한글개수(    실제전문.substring(SOCKET_LEN + 327));
//		System.out.println("예상수신전문" + 예상수신전문.substring(SOCKET_LEN + 327).trim());
//		System.out.println("    실제전문" +     실제전문.substring(SOCKET_LEN + 327).trim());
		assertEquals(예상수신전문.substring(SOCKET_LEN + 327).trim()
					,    실제전문.substring(SOCKET_LEN + 327).trim());
		
//		System.out.println("time:"+DateTimeUtil.getToday08()+DateTimeUtil.getTime06()+DateTimeUtil.getTime07());
	}
	
	@Test
	public void test이체_우리2우리로_입금계좌없음() {
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_전송전문_공통        = {   "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_전송전문_거래        = {   "0000000010000 0000000000000000000000000000000020001002038811662   황상하              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_전송전문_공통[0]+전문번호+우리은행_전송전문_공통[1];
		보낼전송전문 += 우리은행_전송전문_거래[0]+우리은행_전송전문_거래[1]; // 정상처리
		예상수신전문 = 오류_없는계좌이체전송전문으로전환(보낼전송전문, 전문번호);
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	private String 전문번호생성() {
		// 거래번호는 7자리지만, 맨앞의 한자리는 KIBNET에서 사용하므로 "0"로 세팅
		trNo ++;
		startTime++;
		return  today+StringUtil.addZero(startTime,6)+"0"+StringUtil.addZero(trNo, 6);
	}

	@Test
	public void test이체_우리2우리로_지급계좌없음() {
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_전송전문_공통        = {   "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_전송전문_거래        = {   "0000000010000 0000000000000000000000000000000020001002038811661   황상하              ", "00000020001002638811652           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_전송전문_공통[0]+전문번호+우리은행_전송전문_공통[1];
		보낼전송전문 += 우리은행_전송전문_거래[0]+우리은행_전송전문_거래[1]; // 정상처리
		예상수신전문 = 오류_지급계좌없는계좌이체전송전문으로전환(보낼전송전문, 전문번호);
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2우리() {
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_전송전문_공통        = {   "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_전송전문_거래        = {   "0000000010000 0000000000000000000000000000000020001002038811661   황상하              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_전송전문_공통[0]+전문번호+우리은행_전송전문_공통[1];
		보낼전송전문 += 우리은행_전송전문_거래[0]+우리은행_전송전문_거래[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호, 우리은행_전송전문_거래[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2신한() {
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {   "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------        -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {   "0000000010000 000000000000000000000000000000008800110164006803    정광호              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2신한26() {
		//      ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {   "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                           금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------        -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {   "0000000010000 000000000000000000000000000000002600110164006803    정광호              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };
		String[] 우리은행_지급응답전문        = {   "0000000010000 000000000000000000000000000000008800110164006803    정광호              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };
		
		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;
		String 예상수신전문_신한88;
		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		예상수신전문_신한88 = 보낼전송전문 + 우리은행_지급응답전문[0]+우리은행_지급거래전문[1];
		
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		
		예상수신전문 = 성공전송전문으로전환(예상수신전문_신한88, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			  
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2하나() { // 081 하나 77291008148507
		//       ----------------------------        ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {   "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------        -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {   "0000000010000 00000000000000000000000000000000810077291008148507  김정자              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	// 하나은행은 은행연결 안될경우 메시지 - 466 입금 정지등록 계좌입AMS-POACOMM-1555
	//     농협은 은행연결 안될경우 메시지 - 466 입금 정지등록 계좌입AMS-POACOMM-1555
	// 신한은행은 은행연결 안될경우 메시지 - 437 이체 가능시간이 아직 안되었습니다.
	// 
//	@Test
	public void test이체_우리2하나로_입금계좌없음() { // 081 하나 77291008148507 정상계좌 77291008148508 계좌없음
		//       ----------------------------        ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {   "06040600000920032902000052003290220032902 302001100466",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------        -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {   "0000000010000 00000000000000000000000000000000810077291008148508  김정수              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 오류_없는계좌이체전송전문으로전환(보낼전송전문, 전문번호);
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2산업() { // 002 산업은행 02002002462310		이장수
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000020002002002462310  이장수              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2산업_입금계좌없음() { // 002 산업은행 02002002462310		이장수
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000020050201042501019  이장수              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 오류_산업_없는계좌이체전송전문으로전환(보낼전송전문, 전문번호); //,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2기업() { // 003 기업은행 50201042501019		나보경
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000030050201042501019  나보경              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2국민() { // 004 국민은행 26150104081320		이성훈
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000040026150104081320  이성훈              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2외환() { // 005 외환은행 620175389911		노진범
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 000000000000000000000000000000000500620175389911    노진범              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2수협() { // 007 수협 23202050648		백낙선
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000070023202050648     백낙선              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2농협() { // 011 농협 20713556028692 임광남
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000110020713556028692  임광남              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2제일() { // 023 제일 21020222626		구영임
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000230021020222626     구영임              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2씨티() { // 027 씨티 1780558426001		최기헌
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 0000000000000000000000000000000027001780558426001   최기헌              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2씨티로2() { // 027 씨티 15181741267		탁동환
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000270015181741267     탁동환              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2대구() { // 031 대구은행 15813007870		박순곤
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000310015813007870     박순곤              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2부산() { // 032 부산은행 225120440980		이정은
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 000000000000000000000000000000003200225120440980    이정은              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2광주() { // 034 광주은행 186121009027		김수진
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 000000000000000000000000000000003400186121009027    김수진              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2제주() { // 035 제주은행 5002174987		조천현
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 0000000000000000000000000000000035005002174987      조천현              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2전북() { // 037 전북은행 544210507798		이지순
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 000000000000000000000000000000003700544210507798    이지순              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

	@Test
	public void test이체_우리2경남() { // 039 경남은행 542210277305		조현정
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 000000000000000000000000000000003900542210277305    조현정              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

//	@Test
	public void test이체_우리2_36() { // 036 씨티은행-(구)경기  52319525261		홍승관
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000360052319525261     홍승관              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2새마을금고() { // 045 새마을금고 3808090012527		최금옥
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 0000000000000000000000000000000045003808090012527   최금옥              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2신협() { // 048 신협 0321313161944		이종한
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 0000000000000000000000000000000048000321313161944   이종한              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test이체_우리2정통부() { // 071 정통부 10074302077291		김돌연
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {    "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {    "0000000010000 00000000000000000000000000000000710010074302077291  김돌연              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

//	@Test
	public void test이체_신한2신한() {
		//       ----------------------------        ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_지급공통전문        = {   "06040600000920032902000052003290220032902 302001100000",                  "20000009880                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------        -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_지급거래전문        = {   "0000000010000 000000000000000000000000000000008800110164006803    정광호              ", "0000008800100024180210            하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_지급공통전문[0]+전문번호+우리은행_지급공통전문[1];
		보낼전송전문 += 우리은행_지급거래전문[0]+우리은행_지급거래전문[1]; // 정상처리
		예상수신전문 = 성공전송전문으로전환(보낼전송전문, 전문번호,우리은행_지급거래전문[0].substring(46, 48));
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
	}

//	@Test
	public void test같은계좌이체오류() {
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890    -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		//       ----------------------------         ####====----========-===-========---------=----====rrryyyymmddhhmm4s0######=-bankcode*--------------------------------------------------------------------------------------------------------------------------------------------------------------m234------------------------------------ssssss12341234567890
		String[] 우리은행_전송전문_공통        = {   "06040600000920032902000052003290220032902 302001100000",                  "20000009200                                                                                                                                                                                                      000000              "};
		//                                            금액정보--------------------------------입금계좌부====================================    출금계좌부--------------------------------------------개별부----------------------------------------------------------------------------------------------------------------------------------------------------------
		//       ----------------------------         -------------=-------------=============bankcode==n234567890123456name567890123456name    bankcode00n23456789012345nPASSWORDname567890123456name=====---==--------======--========------==--------======--========------==--------======--===------------00000------============================================
		String[] 우리은행_전송전문_거래        = {   "0000000050000 0000000000000000000000000000000020001002638811651   황상하              ", "00000020001002638811651           하이캐피탈          0000000000              00              00              00              00              00               00000                                                  " };

		String 보낼전송전문;
		String 예상수신전문;
		String 실제전문;
		String 전문번호;

		//////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////
		전문번호 = 전문번호생성();
		
		보낼전송전문  = 우리은행_전송전문_공통[0]+전문번호+우리은행_전송전문_공통[1];
		보낼전송전문 += 우리은행_전송전문_거래[0]+우리은행_전송전문_거래[1]; // 정상처리
		예상수신전문 = 오류_같은계좌이체전송전문으로전환(보낼전송전문, 전문번호);
		try {
			실제전문 = GramExecutor.getInstance().sendMsg(GRAM_CD, 보낼전송전문);
			
			예상수신전문과실제전문비교(예상수신전문, 실제전문);
		} catch (Exception e) {
			fail("전문 송수신 실패..");
			e.printStackTrace();
		}
		
	}

	@Test
	public void test전문번호생성() {
		String 전문번호1 = 전문번호생성();
		String 전문번호2 = 전문번호생성();
		
		assertFalse(전문번호1.equals(전문번호2));
	
		전문번호1 = 전문번호생성();
		전문번호2 = 전문번호생성();
		
		assertFalse(전문번호1.equals(전문번호2));
	}
}
